[Survived] ObjectLiteral
src/generator/html.js:7:25
 export const DOCTYPE = '<!DOCTYPE html>';
 
 // Language settings
-export const LANGUAGE = {
-  EN: 'en',
-};
+export const LANGUAGE = {};
 
 // HTML tag names

[Survived] StringLiteral
src/generator/html.js:16:9
 
 // HTML attribute names
 export const ATTR_NAME = {
-  LANG: 'lang',
+  LANG: "",
   CLASS: 'class',
   ID: 'id',

[Killed] StringLiteral
src/generator/html.js:18:7
 export const ATTR_NAME = {
   LANG: 'lang',
   CLASS: 'class',
-  ID: 'id',
+  ID: "",
 };
 
killedBy: Blog Generator should generate complete HTML page with multiple posts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

[Survived] StringLiteral
src/generator/html.js:25:21
 export const HTML_ESCAPE_REPLACEMENTS = [
   { from: /&/g, to: '&amp;' },
   { from: /</g, to: '&lt;' },
-  { from: />/g, to: '&gt;' },
+  { from: />/g, to: "" },
   { from: /"/g, to: '&quot;' },
   { from: /'/g, to: '&#039;' },

[Survived] StringLiteral
src/generator/html.js:27:21
   { from: /</g, to: '&lt;' },
   { from: />/g, to: '&gt;' },
   { from: /"/g, to: '&quot;' },
-  { from: /'/g, to: '&#039;' },
+  { from: /'/g, to: "" },
 ];
 

[Killed] BlockStatement
src/generator/html.js:37:29
  * @param {Array<string>} parts - The array of strings to join
  * @returns {string} - The joined string
  */
-export function join(parts) {
-  return parts.join('');
-}
+export function join(parts) {}
 
 // HTML tag and attribute symbols
killedBy: Blog Generator should generate complete HTML page with multiple posts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Received: "<html><body></body></html>"

[Killed] StringLiteral
src/generator/html.js:45:22
 export const TAG_OPEN = '<';
 export const TAG_CLOSE = '>';
 export const SPACE = ' ';
-export const SLASH = '/';
+export const SLASH = "";
 export const EQUALS = '=';
 export const QUOTE = '"';
killedBy: Blog Generator should generate complete HTML page with multiple posts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

[Killed] BlockStatement
src/generator/html.js:55:54
  * @param {string} attributes - The HTML attributes as a string
  * @returns {Array<string>} - Array of tag parts
  */
-export function getOpeningTagParts(name, attributes) {
-  return [TAG_OPEN, name, SPACE, attributes, TAG_CLOSE];
-}
+export function getOpeningTagParts(name, attributes) {}
 
 /**
killedBy: Blog Generator should generate complete HTML page with multiple posts
statusReason: TypeError: Cannot read properties of undefined (reading 'join')

[Killed] BlockStatement
src/generator/html.js:65:55
  * @param {string} attributes - The HTML attributes as a string
  * @returns {string} - The opening HTML tag
  */
-export function createOpeningTag(tagName, attributes) {
-  const tagParts = getOpeningTagParts(tagName, attributes);
-  return join(tagParts);
-}
+export function createOpeningTag(tagName, attributes) {}
 
 /**
killedBy: Blog Generator should generate complete HTML page with multiple posts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

[Killed] BlockStatement
src/generator/html.js:75:42
  * @param {string} name - The HTML tag name
  * @returns {Array<string>} - Array of tag parts
  */
-export function getClosingTagParts(name) {
-  return [TAG_OPEN, SLASH, name, TAG_CLOSE];
-}
+export function getClosingTagParts(name) {}
 
 /**
killedBy: Blog Generator should generate complete HTML page with multiple posts
statusReason: TypeError: Cannot read properties of undefined (reading 'join')

[Killed] BlockStatement
src/generator/html.js:84:43
  * @param {string} tagName - The HTML tag name
  * @returns {string} - The closing HTML tag
  */
-export function createClosingTag(tagName) {
-  const tagParts = getClosingTagParts(tagName);
-  return join(tagParts);
-}
+export function createClosingTag(tagName) {}
 
 /**
killedBy: Blog Generator should generate complete HTML page with multiple posts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

[Killed] BlockStatement
src/generator/html.js:96:57
  * @param {string} content - The content to place inside the tag
  * @returns {string} - The complete HTML tag
  */
-export function createTag(tagName, attributes, content) {
-  const openingTag = createOpeningTag(tagName, attributes);
-  const closingTag = createClosingTag(tagName);
-  const tagParts = [openingTag, content, closingTag];
-  return join(tagParts);
-}
+export function createTag(tagName, attributes, content) {}
 
 /**
killedBy: Blog Generator should generate complete HTML page with multiple posts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Received: "<html><body></body></html>"

[Killed] ArrayDeclaration
src/generator/html.js:99:20
 export function createTag(tagName, attributes, content) {
   const openingTag = createOpeningTag(tagName, attributes);
   const closingTag = createClosingTag(tagName);
-  const tagParts = [openingTag, content, closingTag];
+  const tagParts = [];
   return join(tagParts);
 }
killedBy: Blog Generator should generate complete HTML page with multiple posts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Received: "<html><body></body></html>"

[Killed] BlockStatement
src/generator/html.js:109:55
  * @param {string} attrValue - The attribute value
  * @returns {Array<string>} - Array of attribute parts
  */
-export function getAttrPairParts(attrName, attrValue) {
-  return [attrName, EQUALS, QUOTE, attrValue, QUOTE];
-}
+export function getAttrPairParts(attrName, attrValue) {}
 
 /**
killedBy: Blog Generator should generate complete HTML page with multiple posts
statusReason: TypeError: Cannot read properties of undefined (reading 'join')

[Killed] ArrayDeclaration
src/generator/html.js:110:10
  * @returns {Array<string>} - Array of attribute parts
  */
 export function getAttrPairParts(attrName, attrValue) {
-  return [attrName, EQUALS, QUOTE, attrValue, QUOTE];
+  return [];
 }
 
killedBy: Blog Generator should generate complete HTML page with multiple posts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

[Killed] BlockStatement
src/generator/html.js:119:53
  * @param {string} attrValue - The attribute value
  * @returns {string} - Formatted attribute string (name="value")
  */
-export function createAttrPair(attrName, attrValue) {
-  const attrParts = getAttrPairParts(attrName, attrValue);
-  return join(attrParts);
-}
+export function createAttrPair(attrName, attrValue) {}
 
 /**
killedBy: Blog Generator should generate complete HTML page with multiple posts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

[Killed] BlockStatement
src/generator/html.js:132:63
  * @param {string} replacement.to - The replacement string
  * @returns {string} - Text with the replacement applied
  */
-export function applyHtmlEscapeReplacement(text, replacement) {
-  const { from, to } = replacement;
-  return text.replace(from, to);
-}
+export function applyHtmlEscapeReplacement(text, replacement) {}
 
 /**
killedBy: Blog Generator should generate complete HTML page with multiple posts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

[Killed] BlockStatement
src/generator/html.js:143:68
  * @param {Array<Object>} replacements - Array of replacement definitions
  * @returns {string} - Text with all replacements applied
  */
-export function applyAllHtmlEscapeReplacements(text, replacements) {
-  return replacements.reduce(applyHtmlEscapeReplacement, text);
-}
+export function applyAllHtmlEscapeReplacements(text, replacements) {}
 
 /**
killedBy: Blog Generator should generate complete HTML page with multiple posts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

[Killed] BlockStatement
src/generator/html.js:152:34
  * @param {string} text - The text to escape
  * @returns {string} - HTML-escaped text
  */
-export function escapeHtml(text) {
-  return applyAllHtmlEscapeReplacements(text, HTML_ESCAPE_REPLACEMENTS);
-}
+export function escapeHtml(text) {}
 
 /**
killedBy: Blog Generator should generate complete HTML page with multiple posts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

[NoCoverage] BlockStatement
src/generator/html.js:161:40
  * @param {string} content - The content to wrap in the HTML tag
  * @returns {string} - The HTML tag with content
  */
-export function createHtmlTag(content) {
-  const langAttr = createAttrPair(ATTR_NAME.LANG, LANGUAGE.EN);
-  return createTag(HTML_TAG_NAME, langAttr, content);
-}
+export function createHtmlTag(content) {}
 
 /**

[NoCoverage] BlockStatement
src/generator/html.js:171:35
  * @param {string} content - The content to wrap
  * @returns {string} - The complete HTML document
  */
-export function wrapHtml(content) {
-  const htmlTag = createHtmlTag(content);
-  return join([DOCTYPE, htmlTag]);
-}
+export function wrapHtml(content) {}
 
