[Killed] BlockStatement
src/generator/generator.js:6:36
  * @param {string|string[]} content - A string or an array of strings.
  * @returns {string} - HTML string composed of paragraph elements.
  */
-function createParagraphs(content) {
-  if (Array.isArray(content)) {
-    return content.map(para => `<p>${para}</p>`).join('');
-  } else {
-    return `<p>${content}</p>`;
-  }
-}
+function createParagraphs(content) {}
 
 /**
killedBy: Blog Generator should render quotes as blockquotes
statusReason: Error: expect(received).toBe(expected) // Object.is equality

[Killed] ConditionalExpression
src/generator/generator.js:7:7
  * @returns {string} - HTML string composed of paragraph elements.
  */
 function createParagraphs(content) {
-  if (Array.isArray(content)) {
+  if (false) {
     return content.map(para => `<p>${para}</p>`).join('');
   } else {
killedBy: Blog Generator should render quotes as blockquotes
statusReason: Error: expect(received).toBe(expected) // Object.is equality

[Killed] BlockStatement
src/generator/generator.js:7:31
  * @returns {string} - HTML string composed of paragraph elements.
  */
 function createParagraphs(content) {
-  if (Array.isArray(content)) {
-    return content.map(para => `<p>${para}</p>`).join('');
-  } else {
+  if (Array.isArray(content)) {} else {
     return `<p>${content}</p>`;
   }
killedBy: Blog Generator should render quotes as blockquotes
statusReason: Error: expect(received).toBe(expected) // Object.is equality

[Killed] ArrowFunction
src/generator/generator.js:8:24
  */
 function createParagraphs(content) {
   if (Array.isArray(content)) {
-    return content.map(para => `<p>${para}</p>`).join('');
+    return content.map(() => undefined).join('');
   } else {
     return `<p>${content}</p>`;
killedBy: Blog Generator should render quotes as blockquotes
statusReason: Error: expect(received).toBe(expected) // Object.is equality

[Killed] BlockStatement
src/generator/generator.js:9:10
 function createParagraphs(content) {
   if (Array.isArray(content)) {
     return content.map(para => `<p>${para}</p>`).join('');
-  } else {
-    return `<p>${content}</p>`;
-  }
+  } else {}
 }
 
killedBy: Blog Generator should render quotes as blockquotes
statusReason: Error: expect(received).toBe(expected) // Object.is equality

[Killed] StringLiteral
src/generator/generator.js:10:12
   if (Array.isArray(content)) {
     return content.map(para => `<p>${para}</p>`).join('');
   } else {
-    return `<p>${content}</p>`;
+    return ``;
   }
 }
killedBy: Blog Generator should render quotes as blockquotes
statusReason: Error: expect(received).toBe(expected) // Object.is equality

[Killed] BlockStatement
src/generator/generator.js:19:36
  * @param {string|string[]} content - A string or an array of strings.
  * @returns {string} - The blockquote HTML.
  */
-function createBlockquote(content) {
-  const paragraphs = createParagraphs(content);
-  return `<blockquote class="${CLASS.VALUE}">${BLOCKQUOTE_CORNERS}${paragraphs}</blockquote>`;
-}
+function createBlockquote(content) {}
 import { headElement } from './head.js';
 import { fullWidthElement } from './full-width.js';
killedBy: Blog Generator should render quotes as blockquotes
statusReason: Error: expect(received).toBe(expected) // Object.is equality

[Killed] ObjectLiteral
src/generator/generator.js:37:15
 } from './html.js';
 
 // CSS class names
-const CLASS = {
-  KEY: 'key',
-  VALUE: 'value',
-  ENTRY: 'entry',
-  ARTICLE_TITLE: 'article-title',
-  METADATA: 'metadata',
-  FOOTER: 'footer',
-  WARNING: 'warning',
-  MEDIA: 'media',
-  FULL_WIDTH: 'full-width',
-};
+const CLASS = {};
 
killedBy: Blog Generator should generate complete HTML page with multiple posts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

[Killed] StringLiteral
src/generator/generator.js:53:26
 
 // HTML tag names
 const DIV_TAG_NAME = 'div';
-const ARTICLE_TAG_NAME = 'article';
+const ARTICLE_TAG_NAME = "";
 
 // Date formatting constants
killedBy: Blog Generator should generate complete HTML page with multiple posts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

[Killed] BlockStatement
src/generator/generator.js:74:38
  * @param {string} content - HTML content to place inside the div
  * @returns {string} - HTML div element
  */
-function createDiv(classes, content) {
-  const classAttr = createAttrPair(ATTR_NAME.CLASS, classes);
-  return createTag(DIV_TAG_NAME, classAttr, content);
-}
+function createDiv(classes, content) {}
 
 /**
killedBy: Blog Generator should generate complete HTML page with multiple posts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

[Killed] BlockStatement
src/generator/generator.js:84:31
  * @param {string[]} classes - Array of CSS class names
  * @returns {string} - Space-separated class string
  */
-function joinClasses(classes) {
-  return classes.join(' ');
-}
+function joinClasses(classes) {}
 
 /**
killedBy: Blog Generator should generate complete HTML page with multiple posts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

[Killed] BlockStatement
src/generator/generator.js:94:58
  * @param {string[]} additionalClasses - Additional CSS classes to apply
  * @returns {string} - HTML div element with value class and any additional classes
  */
-function createValueDiv(content, additionalClasses = []) {
-  const classes = [CLASS.VALUE, ...additionalClasses].filter(Boolean);
-  const joinedClasses = joinClasses(classes);
-  return createDiv(joinedClasses, content);
-}
+function createValueDiv(content, additionalClasses = []) {}
 
 /**
killedBy: Blog Generator should generate complete HTML page with multiple posts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

[Killed] ArrayDeclaration
src/generator/generator.js:94:54
  * @param {string[]} additionalClasses - Additional CSS classes to apply
  * @returns {string} - HTML div element with value class and any additional classes
  */
-function createValueDiv(content, additionalClasses = []) {
+function createValueDiv(content, additionalClasses = ["Stryker was here"]) {
   const classes = [CLASS.VALUE, ...additionalClasses].filter(Boolean);
   const joinedClasses = joinClasses(classes);
killedBy: Blog Generator should generate complete HTML page with multiple posts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

[Survived] MethodExpression
src/generator/generator.js:95:19
  * @returns {string} - HTML div element with value class and any additional classes
  */
 function createValueDiv(content, additionalClasses = []) {
-  const classes = [CLASS.VALUE, ...additionalClasses].filter(Boolean);
+  const classes = [CLASS.VALUE, ...additionalClasses];
   const joinedClasses = joinClasses(classes);
   return createDiv(joinedClasses, content);

[Killed] ArrayDeclaration
src/generator/generator.js:95:19
  * @returns {string} - HTML div element with value class and any additional classes
  */
 function createValueDiv(content, additionalClasses = []) {
-  const classes = [CLASS.VALUE, ...additionalClasses].filter(Boolean);
+  const classes = [].filter(Boolean);
   const joinedClasses = joinClasses(classes);
   return createDiv(joinedClasses, content);
killedBy: Blog Generator should generate complete HTML page with multiple posts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

[Killed] BlockStatement
src/generator/generator.js:106:37
  * @param {string} second - The second part
  * @returns {Array<string>} - Array containing both parts
  */
-function createParts(first, second) {
-  return [first, second];
-}
+function createParts(first, second) {}
 
 /**
killedBy: Blog Generator should generate complete HTML page with multiple posts
statusReason: TypeError: Cannot read properties of undefined (reading 'join')

[Killed] BlockStatement
src/generator/generator.js:116:36
  * @param {string} second - The second element
  * @returns {string} - Combined HTML without newlines
  */
-function createPair(first, second) {
-  const parts = createParts(first, second);
-  return join(parts);
-}
+function createPair(first, second) {}
 
 /**
killedBy: Blog Generator should generate complete HTML page with multiple posts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

[Killed] BlockStatement
src/generator/generator.js:126:43
  * @param {string} dateString - The date string to convert
  * @returns {Date} - The Date object
  */
-function createDateFromString(dateString) {
-  return new Date(dateString);
-}
+function createDateFromString(dateString) {}
 
 /**
killedBy: Blog Generator should generate complete HTML page with multiple posts
statusReason: TypeError: Cannot read properties of undefined (reading 'toLocaleDateString')

[Killed] BlockStatement
src/generator/generator.js:135:38
  * @param {Date} date - The date to format
  * @returns {string} - The formatted date string
  */
-function formatDateWithOptions(date) {
-  return date.toLocaleDateString(DATE_LOCALE, DATE_FORMAT_OPTIONS);
-}
+function formatDateWithOptions(date) {}
 
 /**
killedBy: Blog Generator should generate complete HTML page with multiple posts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

[Killed] BlockStatement
src/generator/generator.js:144:33
  * @param {string} dateString - The date string to format
  * @returns {string} - The formatted date string
  */
-function formatDate(dateString) {
-  const date = createDateFromString(dateString);
-  return formatDateWithOptions(date);
-}
+function formatDate(dateString) {}
 
 // Header components
killedBy: Blog Generator should generate complete HTML page with multiple posts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

[Survived] StringLiteral
src/generator/generator.js:153:23
 
 // No longer using newlines and indentation
 
-const METADATA_TEXT = `Software developer and philosopher in Berlin`;
+const METADATA_TEXT = ``;
 
 /**

[Killed] BlockStatement
src/generator/generator.js:159:30
  * Create an empty div with the key class
  * @returns {string} - HTML div element with key class and no content
  */
-function createEmptyKeyDiv() {
-  return createDiv(CLASS.KEY, '');
-}
+function createEmptyKeyDiv() {}
 
 function prefixWithEmptyKey(valueDiv) {
killedBy: Blog Generator should generate complete HTML page with multiple posts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

[Killed] StringLiteral
src/generator/generator.js:160:31
  * @returns {string} - HTML div element with key class and no content
  */
 function createEmptyKeyDiv() {
-  return createDiv(CLASS.KEY, '');
+  return createDiv(CLASS.KEY, "Stryker was here!");
 }
 
killedBy: Blog Generator should generate complete HTML page with multiple posts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

[NoCoverage] BlockStatement
src/generator/generator.js:163:39
   return createDiv(CLASS.KEY, '');
 }
 
-function prefixWithEmptyKey(valueDiv) {
-  const emptyKeyDiv = createEmptyKeyDiv();
-  return createPair(emptyKeyDiv, valueDiv);
-}
+function prefixWithEmptyKey(valueDiv) {}
 
 /**

[NoCoverage] BlockStatement
src/generator/generator.js:171:32
 /**
  * Create the content for the header section
  */
-function createHeaderContent() {
-  const valueDivs = [
-    createValueDiv(HEADER_BANNER),
-    createValueDiv(METADATA_TEXT, [CLASS.METADATA])
-  ];
-
-  const parts = valueDivs.map(prefixWithEmptyKey);
-  
-  return join(parts);
-}
+function createHeaderContent() {}
 
 /**

[NoCoverage] ArrayDeclaration
src/generator/generator.js:174:35
 function createHeaderContent() {
   const valueDivs = [
     createValueDiv(HEADER_BANNER),
-    createValueDiv(METADATA_TEXT, [CLASS.METADATA])
+    createValueDiv(METADATA_TEXT, [])
   ];
 

[NoCoverage] BlockStatement
src/generator/generator.js:187:33
  * @param {string} content - The content to wrap in a section
  * @returns {string} - HTML for the section
  */
-function createSection(content) {
-  return createDiv(CLASS.ENTRY, content);
-}
+function createSection(content) {}
 
 /**

[NoCoverage] BlockStatement
src/generator/generator.js:195:32
  * Create the header section with banner and metadata
  * @returns {string} - HTML for the header section
  */
-function createHeaderSection() {
-  const headerContent = createHeaderContent();
-  return createSection(headerContent);
-}
+function createHeaderSection() {}
 
 // Footer components

[NoCoverage] BlockStatement
src/generator/generator.js:208:32
  * Create the content for the footer section
  * @returns {string} - HTML for the footer content
  */
-function createFooterContent() {
-  const classes = joinClasses([CLASS.FOOTER, CLASS.VALUE, CLASS.WARNING]);
-  const footerDiv = createDiv(classes, WARNING_MESSAGE);
-  return prefixWithEmptyKey(footerDiv);
-}
+function createFooterContent() {}
 
 /**

[NoCoverage] BlockStatement
src/generator/generator.js:218:32
  * Create the footer section with warning message
  * @returns {string} - HTML for the footer section
  */
-function createFooterSection() {
-  const footerContent = createFooterContent();
-  return createSection(footerContent);
-}
+function createFooterSection() {}
 
 // Page structure

[NoCoverage] BlockStatement
src/generator/generator.js:228:35
  * Create the opening tag for the container div
  * @returns {string} - Opening div tag with container ID
  */
-function createContainerDivOpen() {
-  const idAttr = createAttrPair(ATTR_NAME.ID, CONTAINER_ID);
-  return `<${DIV_TAG_NAME} ${idAttr}>`;
-}
+function createContainerDivOpen() {}
 
 /**

[NoCoverage] StringLiteral
src/generator/generator.js:230:10
  */
 function createContainerDivOpen() {
   const idAttr = createAttrPair(ATTR_NAME.ID, CONTAINER_ID);
-  return `<${DIV_TAG_NAME} ${idAttr}>`;
+  return ``;
 }
 

[NoCoverage] BlockStatement
src/generator/generator.js:236:50
 /**
  * Create the header content array
  */
-function createHeaderContentArray(headerElement) {
-  return [
-    headElement,
-    '<body>',
-    createContainerDivOpen(),
-    '<!-- Header -->',
-    headerElement,
-  ];
-}
+function createHeaderContentArray(headerElement) {}
 
 /**

[NoCoverage] ArrayDeclaration
src/generator/generator.js:237:10
  * Create the header content array
  */
 function createHeaderContentArray(headerElement) {
-  return [
-    headElement,
-    '<body>',
-    createContainerDivOpen(),
-    '<!-- Header -->',
-    headerElement,
-  ];
+  return [];
 }
 

[NoCoverage] BlockStatement
src/generator/generator.js:249:29
 /**
  * Create the page header with head element, body opening tag and header section
  */
-function createPageHeader() {
-  const headerElement = createHeaderSection();
-  const contentArray = createHeaderContentArray(headerElement);
-
-  return contentArray.join('');
-}
+function createPageHeader() {}
 
 /**

[NoCoverage] BlockStatement
src/generator/generator.js:259:36
 /**
  * Create the closing container div
  */
-function createContainerDivClose() {
-  return '</div>';
-}
+function createContainerDivClose() {}
 
 /**

[NoCoverage] BlockStatement
src/generator/generator.js:266:28
 /**
  * Create the body closing tag
  */
-function createBodyClose() {
-  return '</body>';
-}
+function createBodyClose() {}
 
 /**

[NoCoverage] StringLiteral
src/generator/generator.js:267:10
  * Create the body closing tag
  */
 function createBodyClose() {
-  return '</body>';
+  return "";
 }
 

[NoCoverage] BlockStatement
src/generator/generator.js:273:50
 /**
  * Create the footer content array
  */
-function createFooterContentArray(footerElement) {
-  return [
-    '',
-    footerElement,
-    createContainerDivClose(),
-    scriptTag,
-    createBodyClose(),
-  ];
-}
+function createFooterContentArray(footerElement) {}
 
 /**

[NoCoverage] ArrayDeclaration
src/generator/generator.js:274:10
  * Create the footer content array
  */
 function createFooterContentArray(footerElement) {
-  return [
-    '',
-    footerElement,
-    createContainerDivClose(),
-    scriptTag,
-    createBodyClose(),
-  ];
+  return [];
 }
 

[NoCoverage] StringLiteral
src/generator/generator.js:275:5
  */
 function createFooterContentArray(footerElement) {
   return [
-    '',
+    "Stryker was here!",
     footerElement,
     createContainerDivClose(),

[NoCoverage] BlockStatement
src/generator/generator.js:286:29
 /**
  * Create the page footer with footer section, container div closing, and body closing tag
  */
-function createPageFooter() {
-  const footerElement = createFooterSection();
-  const contentArray = createFooterContentArray(footerElement);
-
-  return contentArray.join('');
-}
+function createPageFooter() {}
 
 /**

[Killed] BlockStatement
src/generator/generator.js:296:41
 /**
  * Convert a post to article HTML
  */
-function convertPostToArticleHTML(post) {
-  return generateArticle(post);
-}
+function convertPostToArticleHTML(post) {}
 
 /**
killedBy: Blog Generator should generate complete HTML page with multiple posts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Received: "<html><body></body></html>"

[Killed] BlockStatement
src/generator/generator.js:303:41
 /**
  * Format article HTML with indentation
  */
-function formatArticleHTML(articleHTML) {
-  return articleHTML;
-}
+function formatArticleHTML(articleHTML) {}
 
 /**
killedBy: Blog Generator should generate complete HTML page with multiple posts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Received: "<html><body></body></html>"

[Killed] BlockStatement
src/generator/generator.js:310:36
 /**
  * Process posts and join article HTML
  */
-function processPostsToHTML(posts) {
-  return posts.map(convertPostToArticleHTML)
-              .map(formatArticleHTML)
-              .join('');
-}
+function processPostsToHTML(posts) {}
 
 /**
killedBy: Blog Generator should generate complete HTML page with multiple posts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Received: "<html><body></body></html>"

[Killed] BlockStatement
src/generator/generator.js:319:34
 /**
  * Generate HTML for all articles in the blog
  */
-function generateArticles(posts) {
-  return processPostsToHTML(posts);
-}
+function generateArticles(posts) {}
 
 /**
killedBy: Blog Generator should generate complete HTML page with multiple posts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Received: "<html><body></body></html>"

[Killed] BlockStatement
src/generator/generator.js:326:42
 /**
  * Create attributes for an article element
  */
-function createIdAttributeIfNeeded(post) {
-  if (!post.key) {
-    return '';
-  }
-
-  return ' ' + createAttrPair(ATTR_NAME.ID, post.key);
-}
+function createIdAttributeIfNeeded(post) {}
 
 /**
killedBy: Blog Generator should generate complete HTML page with multiple posts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

[Killed] BooleanLiteral
src/generator/generator.js:327:7
  * Create attributes for an article element
  */
 function createIdAttributeIfNeeded(post) {
-  if (!post.key) {
+  if (post.key) {
     return '';
   }
killedBy: Blog Generator should generate complete HTML page with multiple posts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

[Killed] ConditionalExpression
src/generator/generator.js:327:7
  * Create attributes for an article element
  */
 function createIdAttributeIfNeeded(post) {
-  if (!post.key) {
+  if (true) {
     return '';
   }
killedBy: Blog Generator should generate complete HTML page with multiple posts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

[NoCoverage] StringLiteral
src/generator/generator.js:328:12
  */
 function createIdAttributeIfNeeded(post) {
   if (!post.key) {
-    return '';
+    return "Stryker was here!";
   }
 

[Killed] BlockStatement
src/generator/generator.js:337:40
 /**
  * Create attributes for an article element
  */
-function createArticleAttributes(post) {
-  const tagClasses = hasTags(post) ? post.tags.map(tag => `tag-${tag}`).join(' ') : '';
-  const classValue = tagClasses ? `${CLASS.ENTRY} ${tagClasses}` : CLASS.ENTRY;
-  const classAttr = createAttrPair(ATTR_NAME.CLASS, classValue);
-  const idAttr = createIdAttributeIfNeeded(post);
-  return `${classAttr}${idAttr}`;
-}
+function createArticleAttributes(post) {}
 
 /**
killedBy: Blog Generator should generate complete HTML page with multiple posts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

[Killed] ArrowFunction
src/generator/generator.js:338:52
  * Create attributes for an article element
  */
 function createArticleAttributes(post) {
-  const tagClasses = hasTags(post) ? post.tags.map(tag => `tag-${tag}`).join(' ') : '';
+  const tagClasses = hasTags(post) ? post.tags.map(() => undefined).join(' ') : '';
   const classValue = tagClasses ? `${CLASS.ENTRY} ${tagClasses}` : CLASS.ENTRY;
   const classAttr = createAttrPair(ATTR_NAME.CLASS, classValue);
killedBy: Blog Generator should display tags for posts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

[Killed] StringLiteral
src/generator/generator.js:338:78
  * Create attributes for an article element
  */
 function createArticleAttributes(post) {
-  const tagClasses = hasTags(post) ? post.tags.map(tag => `tag-${tag}`).join(' ') : '';
+  const tagClasses = hasTags(post) ? post.tags.map(tag => `tag-${tag}`).join("") : '';
   const classValue = tagClasses ? `${CLASS.ENTRY} ${tagClasses}` : CLASS.ENTRY;
   const classAttr = createAttrPair(ATTR_NAME.CLASS, classValue);
killedBy: Blog Generator should display tags for posts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

[Killed] StringLiteral
src/generator/generator.js:339:35
  */
 function createArticleAttributes(post) {
   const tagClasses = hasTags(post) ? post.tags.map(tag => `tag-${tag}`).join(' ') : '';
-  const classValue = tagClasses ? `${CLASS.ENTRY} ${tagClasses}` : CLASS.ENTRY;
+  const classValue = tagClasses ? `` : CLASS.ENTRY;
   const classAttr = createAttrPair(ATTR_NAME.CLASS, classValue);
   const idAttr = createIdAttributeIfNeeded(post);
killedBy: Blog Generator should display tags for posts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

[Killed] BlockStatement
src/generator/generator.js:348:40
 /**
  * Format article content with full width element
  */
-function formatArticleContent(content) {
-  return `${fullWidthElement}${content}`;
-}
+function formatArticleContent(content) {}
 
 /**
killedBy: Blog Generator should generate complete HTML page with multiple posts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Received: "<html><body><article class=\"entry\" id=\"FIRS1\"></article><article class=\"entry\" id=\"SECO2\"></article></body></html>"

[Killed] BlockStatement
src/generator/generator.js:355:32
 /**
  * Create an article from a blog post
  */
-function generateArticle(post) {
-  const content = generateArticleContent(post);
-  const formattedContent = formatArticleContent(content);
-  const attributes = createArticleAttributes(post);
-
-  return createTag(ARTICLE_TAG_NAME, attributes, formattedContent);
-}
+function generateArticle(post) {}
 
 /**
killedBy: Blog Generator should generate complete HTML page with multiple posts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Received: "<html><body></body></html>"

[Killed] BlockStatement
src/generator/generator.js:366:32
 /**
  * Get content array from post, defaulting to empty array if not present
  */
-function getContentArray(post) {
-  return post.content || [];
-}
+function getContentArray(post) {}
 
 /**
killedBy: Blog Generator should generate complete HTML page with multiple posts
statusReason: TypeError: Cannot read properties of undefined (reading 'map')

[Killed] ConditionalExpression
src/generator/generator.js:367:10
  * Get content array from post, defaulting to empty array if not present
  */
 function getContentArray(post) {
-  return post.content || [];
+  return true;
 }
 
killedBy: Blog Generator should generate complete HTML page with multiple posts
statusReason: TypeError: contentArray.map is not a function

[Killed] LogicalOperator
src/generator/generator.js:367:10
  * Get content array from post, defaulting to empty array if not present
  */
 function getContentArray(post) {
-  return post.content || [];
+  return post.content && [];
 }
 
killedBy: Blog Generator should generate complete HTML page with multiple posts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

[Killed] BlockStatement
src/generator/generator.js:373:36
 /**
  * Determine if an item is the first in the content array
  */
-function isFirstContentItem(index) {
-  return index === 0;
-}
+function isFirstContentItem(index) {}
 
 /**
killedBy: Blog Generator should generate complete HTML page with multiple posts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

[Killed] ConditionalExpression
src/generator/generator.js:374:10
  * Determine if an item is the first in the content array
  */
 function isFirstContentItem(index) {
-  return index === 0;
+  return true;
 }
 
killedBy: Blog Generator should generate complete HTML page with multiple posts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

[Killed] EqualityOperator
src/generator/generator.js:374:10
  * Determine if an item is the first in the content array
  */
 function isFirstContentItem(index) {
-  return index === 0;
+  return index !== 0;
 }
 
killedBy: Blog Generator should generate complete HTML page with multiple posts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

[Killed] BlockStatement
src/generator/generator.js:380:50
 /**
  * Create a content item with index awareness
  */
-function createContentItemWithIndex(text, index) {
-  const isFirst = isFirstContentItem(index);
-  return createContentSectionItem(text, isFirst);
-}
+function createContentItemWithIndex(text, index) {}
 
 /**
killedBy: Blog Generator should generate complete HTML page with multiple posts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

[Killed] BlockStatement
src/generator/generator.js:392:40
  * @param {Object|string} content - The content item to normalize.
  * @returns {Object} - Normalized content object.
  */
-function normalizeContentItem(content) {
-  return (typeof content === 'object' && content !== null)
-    ? content
-    : { type: 'text', content };
-}
+function normalizeContentItem(content) {}
 
 /**
killedBy: Blog Generator should generate complete HTML page with multiple posts
statusReason: TypeError: Cannot destructure property 'type' of 'normalizedContent' as it is undefined.

[Killed] ConditionalExpression
src/generator/generator.js:393:11
  * @returns {Object} - Normalized content object.
  */
 function normalizeContentItem(content) {
-  return (typeof content === 'object' && content !== null)
+  return (true)
     ? content
     : { type: 'text', content };
killedBy: Blog Generator should generate complete HTML page with multiple posts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

[Killed] ConditionalExpression
src/generator/generator.js:393:11
  * @returns {Object} - Normalized content object.
  */
 function normalizeContentItem(content) {
-  return (typeof content === 'object' && content !== null)
+  return (true && content !== null)
     ? content
     : { type: 'text', content };
killedBy: Blog Generator should generate complete HTML page with multiple posts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

[Killed] ObjectLiteral
src/generator/generator.js:395:7
 function normalizeContentItem(content) {
   return (typeof content === 'object' && content !== null)
     ? content
-    : { type: 'text', content };
+    : {};
 }
 
killedBy: Blog Generator should generate complete HTML page with multiple posts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

[Killed] BlockStatement
src/generator/generator.js:405:44
   quote: createBlockquote,
 };
 
-function renderValueDiv(normalizedContent) {
-  const { type, content } = normalizedContent;
- 
-  if (type === 'quote') {
-    return CONTENT_RENDERERS.quote(content);
-  }
- 
-  if (type === 'text' && Array.isArray(content)) {
-    return createBlockquote(content);
-  }
- 
-  return `<p class="${CLASS.VALUE}">${content}</p>`;
-}
+function renderValueDiv(normalizedContent) {}
 
 /**
killedBy: Blog Generator should generate complete HTML page with multiple posts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

[Killed] EqualityOperator
src/generator/generator.js:408:7
 function renderValueDiv(normalizedContent) {
   const { type, content } = normalizedContent;
  
-  if (type === 'quote') {
+  if (type !== 'quote') {
     return CONTENT_RENDERERS.quote(content);
   }
killedBy: Blog Generator should generate complete HTML page with multiple posts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

[Killed] BlockStatement
src/generator/generator.js:408:25
 function renderValueDiv(normalizedContent) {
   const { type, content } = normalizedContent;
  
-  if (type === 'quote') {
-    return CONTENT_RENDERERS.quote(content);
-  }
+  if (type === 'quote') {}
  
   if (type === 'text' && Array.isArray(content)) {
killedBy: Blog Generator should render quotes as blockquotes
statusReason: Error: expect(received).toBe(expected) // Object.is equality
