[Killed] ArrayDeclaration
src/generator/generator.js:681:18
 const DEFAULT_RELATED_LINK_ATTRS = 'target="_blank" rel="noopener"';
 
 function escapeRelatedLinkFields(link) {
-  const fields = ['url', 'title', 'author', 'source', 'quote'];
+  const fields = [];
   
   return fields.reduce((acc, field) => {
killedBy: Blog Generator should generate complete HTML page with multiple posts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

[Killed] StringLiteral
src/generator/generator.js:681:45
 const DEFAULT_RELATED_LINK_ATTRS = 'target="_blank" rel="noopener"';
 
 function escapeRelatedLinkFields(link) {
-  const fields = ['url', 'title', 'author', 'source', 'quote'];
+  const fields = ['url', 'title', 'author', "", 'quote'];
   
   return fields.reduce((acc, field) => {
killedBy: Blog Generator should generate complete HTML page with multiple posts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

[Killed] BlockStatement
src/generator/generator.js:683:40
 function escapeRelatedLinkFields(link) {
   const fields = ['url', 'title', 'author', 'source', 'quote'];
   
-  return fields.reduce((acc, field) => {
-    acc[field] = link[field] ? escapeHtml(link[field]) : '';
-    return acc;
-  }, { type: link.type });
+  return fields.reduce((acc, field) => {}, { type: link.type });
 }
 
killedBy: Blog Generator should generate complete HTML page with multiple posts
statusReason: TypeError: Cannot destructure property 'url' of 'escapeRelatedLinkFields(...)' as it is undefined.

[Killed] StringLiteral
src/generator/generator.js:684:58
   const fields = ['url', 'title', 'author', 'source', 'quote'];
   
   return fields.reduce((acc, field) => {
-    acc[field] = link[field] ? escapeHtml(link[field]) : '';
+    acc[field] = link[field] ? escapeHtml(link[field]) : "Stryker was here!";
     return acc;
   }, { type: link.type });
killedBy: Blog Generator should generate complete HTML page with multiple posts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

[Killed] ObjectLiteral
src/generator/generator.js:686:6
   return fields.reduce((acc, field) => {
     acc[field] = link[field] ? escapeHtml(link[field]) : '';
     return acc;
-  }, { type: link.type });
+  }, {});
 }
 
killedBy: Blog Generator should generate complete HTML page with multiple posts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

[Killed] BlockStatement
src/generator/generator.js:689:41
   }, { type: link.type });
 }
 
-function formatTitleByType(type, title) {
-  const formatters = {
-    book: t => `<em>_${t}_</em>`,
-    microblog: t => `"${t}"`,
-    article: t => `"${t}"`,
-    report: t => `"${t}"`
-  };
-
-  return (formatters[type] || (t => t))(title);
-}
+function formatTitleByType(type, title) {}
 
 function formatBaseLink(type, url, title) {
killedBy: Blog Generator should generate complete HTML page with multiple posts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

[Killed] ObjectLiteral
src/generator/generator.js:690:22
 }
 
 function formatTitleByType(type, title) {
-  const formatters = {
-    book: t => `<em>_${t}_</em>`,
-    microblog: t => `"${t}"`,
-    article: t => `"${t}"`,
-    report: t => `"${t}"`
-  };
+  const formatters = {};
 
   return (formatters[type] || (t => t))(title);
killedBy: Blog Generator should generate complete HTML page with multiple posts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

[Killed] ArrowFunction
src/generator/generator.js:691:11
 
 function formatTitleByType(type, title) {
   const formatters = {
-    book: t => `<em>_${t}_</em>`,
+    book: () => undefined,
     microblog: t => `"${t}"`,
     article: t => `"${t}"`,
killedBy: Blog Generator should generate complete HTML page with multiple posts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

[Killed] ArrowFunction
src/generator/generator.js:692:16
 function formatTitleByType(type, title) {
   const formatters = {
     book: t => `<em>_${t}_</em>`,
-    microblog: t => `"${t}"`,
+    microblog: () => undefined,
     article: t => `"${t}"`,
     report: t => `"${t}"`
killedBy: Blog Generator should generate complete HTML page with multiple posts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

[Killed] ArrowFunction
src/generator/generator.js:693:14
   const formatters = {
     book: t => `<em>_${t}_</em>`,
     microblog: t => `"${t}"`,
-    article: t => `"${t}"`,
+    article: () => undefined,
     report: t => `"${t}"`
   };
killedBy: Blog Generator should generate complete HTML page with multiple posts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

[Killed] ArrowFunction
src/generator/generator.js:694:13
     book: t => `<em>_${t}_</em>`,
     microblog: t => `"${t}"`,
     article: t => `"${t}"`,
-    report: t => `"${t}"`
+    report: () => undefined
   };
 
killedBy: Blog Generator should generate complete HTML page with multiple posts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

[Killed] StringLiteral
src/generator/generator.js:694:18
     book: t => `<em>_${t}_</em>`,
     microblog: t => `"${t}"`,
     article: t => `"${t}"`,
-    report: t => `"${t}"`
+    report: t => ``
   };
 
killedBy: Blog Generator should generate complete HTML page with multiple posts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

[Killed] ArrowFunction
src/generator/generator.js:697:32
     report: t => `"${t}"`
   };
 
-  return (formatters[type] || (t => t))(title);
+  return (formatters[type] || (() => undefined))(title);
 }
 
killedBy: Blog Generator should generate complete HTML page with multiple posts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

[Killed] LogicalOperator
src/generator/generator.js:697:11
     report: t => `"${t}"`
   };
 
-  return (formatters[type] || (t => t))(title);
+  return (formatters[type] && (t => t))(title);
 }
 
killedBy: Blog Generator should generate complete HTML page with multiple posts
statusReason: TypeError: (intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value) is not a function

[Killed] BlockStatement
src/generator/generator.js:700:43
   return (formatters[type] || (t => t))(title);
 }
 
-function formatBaseLink(type, url, title) {
-  const formattedTitle = formatTitleByType(type, title);
-  return `<a href="${url}" ${DEFAULT_RELATED_LINK_ATTRS}>${formattedTitle}</a>`;
-}
+function formatBaseLink(type, url, title) {}
 
 function composeLinkParts(baseLink, author, source, quote) {
killedBy: Blog Generator should generate complete HTML page with multiple posts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

[Killed] BlockStatement
src/generator/generator.js:705:60
   return `<a href="${url}" ${DEFAULT_RELATED_LINK_ATTRS}>${formattedTitle}</a>`;
 }
 
-function composeLinkParts(baseLink, author, source, quote) {
-  const optionalParts = [
-    author && ` by ${author}`,
-    source && `, ${source}`,
-    quote && ` ("${quote}")`
-  ];
-
-  return `<li>${[baseLink, ...optionalParts.filter(Boolean)].join('')}</li>`;
-}
+function composeLinkParts(baseLink, author, source, quote) {}
 
 function formatRelatedLink(link) {
killedBy: Blog Generator should generate complete HTML page with multiple posts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

[Killed] LogicalOperator
src/generator/generator.js:707:5
 
 function composeLinkParts(baseLink, author, source, quote) {
   const optionalParts = [
-    author && ` by ${author}`,
+    author || ` by ${author}`,
     source && `, ${source}`,
     quote && ` ("${quote}")`
killedBy: Blog Generator should generate complete HTML page with multiple posts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

[Killed] ConditionalExpression
src/generator/generator.js:707:5
 
 function composeLinkParts(baseLink, author, source, quote) {
   const optionalParts = [
-    author && ` by ${author}`,
+    true,
     source && `, ${source}`,
     quote && ` ("${quote}")`
killedBy: Blog Generator should generate complete HTML page with multiple posts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

[Killed] LogicalOperator
src/generator/generator.js:708:5
 function composeLinkParts(baseLink, author, source, quote) {
   const optionalParts = [
     author && ` by ${author}`,
-    source && `, ${source}`,
+    source || `, ${source}`,
     quote && ` ("${quote}")`
   ];
killedBy: Blog Generator should generate complete HTML page with multiple posts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

[Killed] ConditionalExpression
src/generator/generator.js:708:5
 function composeLinkParts(baseLink, author, source, quote) {
   const optionalParts = [
     author && ` by ${author}`,
-    source && `, ${source}`,
+    true,
     quote && ` ("${quote}")`
   ];
killedBy: Blog Generator should generate complete HTML page with multiple posts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

[Killed] LogicalOperator
src/generator/generator.js:709:5
   const optionalParts = [
     author && ` by ${author}`,
     source && `, ${source}`,
-    quote && ` ("${quote}")`
+    quote || ` ("${quote}")`
   ];
 
killedBy: Blog Generator should generate complete HTML page with multiple posts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

[Killed] ConditionalExpression
src/generator/generator.js:709:5
   const optionalParts = [
     author && ` by ${author}`,
     source && `, ${source}`,
-    quote && ` ("${quote}")`
+    true
   ];
 
killedBy: Blog Generator should generate complete HTML page with multiple posts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

[Survived] MethodExpression
src/generator/generator.js:712:31
     quote && ` ("${quote}")`
   ];
 
-  return `<li>${[baseLink, ...optionalParts.filter(Boolean)].join('')}</li>`;
+  return `<li>${[baseLink, ...optionalParts].join('')}</li>`;
 }
 

[Killed] StringLiteral
src/generator/generator.js:712:10
     quote && ` ("${quote}")`
   ];
 
-  return `<li>${[baseLink, ...optionalParts.filter(Boolean)].join('')}</li>`;
+  return ``;
 }
 
killedBy: Blog Generator should generate complete HTML page with multiple posts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

[Killed] BlockStatement
src/generator/generator.js:715:34
   return `<li>${[baseLink, ...optionalParts.filter(Boolean)].join('')}</li>`;
 }
 
-function formatRelatedLink(link) {
-  const { url, title, author, source, quote, type } = escapeRelatedLinkFields(link);
-  const baseLink = formatBaseLink(type, url, title);
-  return composeLinkParts(baseLink, author, source, quote);
-}
+function formatRelatedLink(link) {}
 
 /**
killedBy: Blog Generator should generate complete HTML page with multiple posts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

[Killed] BlockStatement
src/generator/generator.js:726:44
  * @param {Object} post - The blog post
  * @returns {string} - HTML for the related links section
  */
-function generateRelatedLinksSection(post) {
-  if (!hasRelatedLinks(post)) {
-    return '';
-  }
-
-  const keyDiv = createDiv(CLASS.KEY, 'links');
-  // Join with an empty string to avoid spacing issues in the HTML output
-  const linksList = post.relatedLinks.map(link => formatRelatedLink(link)).join('');
-  const valueContent = `<ul class="related-links">${linksList}</ul>`;
-  const valueDiv = createDiv(CLASS.VALUE, valueContent);
-
-  return formatSection(keyDiv, valueDiv);
-}
+function generateRelatedLinksSection(post) {}
 
 /**
killedBy: Blog Generator should generate complete HTML page with multiple posts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

[Killed] BooleanLiteral
src/generator/generator.js:727:7
  * @returns {string} - HTML for the related links section
  */
 function generateRelatedLinksSection(post) {
-  if (!hasRelatedLinks(post)) {
+  if (hasRelatedLinks(post)) {
     return '';
   }
killedBy: Blog Generator should generate complete HTML page with multiple posts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

[Killed] ConditionalExpression
src/generator/generator.js:727:7
  * @returns {string} - HTML for the related links section
  */
 function generateRelatedLinksSection(post) {
-  if (!hasRelatedLinks(post)) {
+  if (false) {
     return '';
   }
killedBy: Blog Generator should contain content for posts
statusReason: TypeError: Cannot read properties of undefined (reading 'map')

[Killed] ArrowFunction
src/generator/generator.js:733:43
 
   const keyDiv = createDiv(CLASS.KEY, 'links');
   // Join with an empty string to avoid spacing issues in the HTML output
-  const linksList = post.relatedLinks.map(link => formatRelatedLink(link)).join('');
+  const linksList = post.relatedLinks.map(() => undefined).join('');
   const valueContent = `<ul class="related-links">${linksList}</ul>`;
   const valueDiv = createDiv(CLASS.VALUE, valueContent);
killedBy: Blog Generator should generate complete HTML page with multiple posts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

[Killed] StringLiteral
src/generator/generator.js:733:81
 
   const keyDiv = createDiv(CLASS.KEY, 'links');
   // Join with an empty string to avoid spacing issues in the HTML output
-  const linksList = post.relatedLinks.map(link => formatRelatedLink(link)).join('');
+  const linksList = post.relatedLinks.map(link => formatRelatedLink(link)).join("Stryker was here!");
   const valueContent = `<ul class="related-links">${linksList}</ul>`;
   const valueDiv = createDiv(CLASS.VALUE, valueContent);
killedBy: Blog Generator should generate complete HTML page with multiple posts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

[Killed] BlockStatement
src/generator/generator.js:743:43
 /**
  * Combine multiple HTML sections into a single string
  */
-function combineHTMLSections(...sections) {
-  return sections.join('');
-}
+function combineHTMLSections(...sections) {}
 
 /**
killedBy: Blog Generator should generate complete HTML page with multiple posts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

[Killed] BlockStatement
src/generator/generator.js:752:23
  * @param {Object} post - The blog post
  * @returns {boolean} - True if post has a toy component
  */
-function hasToy(post) {
-  return post?.toy?.modulePath && post.toy.functionName;
-}
+function hasToy(post) {}
 
 /**
killedBy: Blog Generator should generate complete HTML page with multiple posts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

[Killed] ConditionalExpression
src/generator/generator.js:753:10
  * @returns {boolean} - True if post has a toy component
  */
 function hasToy(post) {
-  return post?.toy?.modulePath && post.toy.functionName;
+  return true;
 }
 
killedBy: Blog Generator should generate complete HTML page with multiple posts
statusReason: TypeError: Cannot read properties of undefined (reading 'modulePath')

[Killed] LogicalOperator
src/generator/generator.js:753:10
  * @returns {boolean} - True if post has a toy component
  */
 function hasToy(post) {
-  return post?.toy?.modulePath && post.toy.functionName;
+  return post?.toy?.modulePath || post.toy.functionName;
 }
 
killedBy: Blog Generator should generate complete HTML page with multiple posts
statusReason: TypeError: Cannot read properties of undefined (reading 'functionName')

[Killed] BlockStatement
src/generator/generator.js:760:36
  * Generate the input section for a toy component
  * @returns {string} - HTML for the input section
  */
-function generateToyInputSection() {
-  const keyDiv = createDiv(CLASS.KEY, 'in');
-  const valueContent = '<form><input type="text" disabled></form>';
-  const valueDiv = createValueDiv(valueContent);
-  
-  return formatSection(keyDiv, valueDiv);
-}
+function generateToyInputSection() {}
 
 /**
killedBy: Blog Generator should generate complete HTML page with multiple posts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

[Killed] StringLiteral
src/generator/generator.js:761:39
  * @returns {string} - HTML for the input section
  */
 function generateToyInputSection() {
-  const keyDiv = createDiv(CLASS.KEY, 'in');
+  const keyDiv = createDiv(CLASS.KEY, "");
   const valueContent = '<form><input type="text" disabled></form>';
   const valueDiv = createValueDiv(valueContent);
killedBy: Blog Generator should generate complete HTML page with multiple posts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

[Killed] StringLiteral
src/generator/generator.js:762:24
  */
 function generateToyInputSection() {
   const keyDiv = createDiv(CLASS.KEY, 'in');
-  const valueContent = '<form><input type="text" disabled></form>';
+  const valueContent = "";
   const valueDiv = createValueDiv(valueContent);
   
killedBy: Blog Generator should generate complete HTML page with multiple posts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

[Killed] BlockStatement
src/generator/generator.js:772:37
  * Generate the button section for a toy component
  * @returns {string} - HTML for the button section
  */
-function generateToyButtonSection() {
-  const keyDiv = createEmptyKeyDiv();
-  const valueContent = '<button type="submit" disabled>Submit</button>';
-  const valueDiv = createValueDiv(valueContent);
-  
-  return formatSection(keyDiv, valueDiv);
-}
+function generateToyButtonSection() {}
 
 /**
killedBy: Blog Generator should generate complete HTML page with multiple posts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

[Killed] BlockStatement
src/generator/generator.js:784:37
  * Generate the output section for a toy component
  * @returns {string} - HTML for the output section
  */
-function generateToyOutputSection() {
-  const keyDiv = createDiv(CLASS.KEY, 'out');
-  const valueContent = '<p class="output">This toy requires Javascript to run.</p>';
-  const valueDiv = createValueDiv(valueContent, [CLASS.WARNING]);
-  
-  return formatSection(keyDiv, valueDiv);
-}
+function generateToyOutputSection() {}
 
 /**
killedBy: Blog Generator should generate complete HTML page with multiple posts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

[Killed] StringLiteral
src/generator/generator.js:785:39
  * @returns {string} - HTML for the output section
  */
 function generateToyOutputSection() {
-  const keyDiv = createDiv(CLASS.KEY, 'out');
+  const keyDiv = createDiv(CLASS.KEY, "");
   const valueContent = '<p class="output">This toy requires Javascript to run.</p>';
   const valueDiv = createValueDiv(valueContent, [CLASS.WARNING]);
killedBy: Blog Generator should generate complete HTML page with multiple posts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

[Killed] BlockStatement
src/generator/generator.js:797:34
  * @param {Object} post - The blog post
  * @returns {string} - HTML script tag
  */
-function generateToyScript(post) {
-  const scriptContent = `window.addComponent('${post.key}', '${post.toy.modulePath}', '${post.toy.functionName}');`;
-  return `<script type="module">${scriptContent}</script>`;
-}
+function generateToyScript(post) {}
 
 /**
killedBy: Blog Generator should generate complete HTML page with multiple posts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

[Killed] StringLiteral
src/generator/generator.js:798:25
  * @returns {string} - HTML script tag
  */
 function generateToyScript(post) {
-  const scriptContent = `window.addComponent('${post.key}', '${post.toy.modulePath}', '${post.toy.functionName}');`;
+  const scriptContent = ``;
   return `<script type="module">${scriptContent}</script>`;
 }
killedBy: Blog Generator should generate complete HTML page with multiple posts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

[Killed] BlockStatement
src/generator/generator.js:807:37
  * @param {Object} post - The blog post
  * @returns {string} - HTML for the toy UI components
  */
-function generateToyUISection(post) {
-  if (!hasToy(post)) {
-    return '';
-  }
-  
-  return combineHTMLSections(
-    generateToyInputSection(),
-    generateToyButtonSection(),
-    generateToyOutputSection()
-  );
-}
+function generateToyUISection(post) {}
 
 /**
killedBy: Blog Generator should generate complete HTML page with multiple posts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

[Killed] BlockStatement
src/generator/generator.js:808:22
  * @returns {string} - HTML for the toy UI components
  */
 function generateToyUISection(post) {
-  if (!hasToy(post)) {
-    return '';
-  }
+  if (!hasToy(post)) {}
   
   return combineHTMLSections(
killedBy: Blog Generator should generate complete HTML page with multiple posts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

[Killed] BooleanLiteral
src/generator/generator.js:808:7
  * @returns {string} - HTML for the toy UI components
  */
 function generateToyUISection(post) {
-  if (!hasToy(post)) {
+  if (hasToy(post)) {
     return '';
   }
killedBy: Blog Generator should generate complete HTML page with multiple posts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

[Killed] BlockStatement
src/generator/generator.js:824:41
  * @param {Object} post - The blog post
  * @returns {string} - HTML for the toy script section
  */
-function generateToyScriptSection(post) {
-  if (!hasToy(post)) {
-    return '';
-  }
-  
-  return generateToyScript(post);
-}
+function generateToyScriptSection(post) {}
 
 /**
killedBy: Blog Generator should generate complete HTML page with multiple posts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

[Killed] BlockStatement
src/generator/generator.js:825:22
  * @returns {string} - HTML for the toy script section
  */
 function generateToyScriptSection(post) {
-  if (!hasToy(post)) {
-    return '';
-  }
+  if (!hasToy(post)) {}
   
   return generateToyScript(post);
killedBy: Blog Generator should generate complete HTML page with multiple posts
statusReason: TypeError: Cannot read properties of undefined (reading 'modulePath')

[Killed] ConditionalExpression
src/generator/generator.js:825:7
  * @returns {string} - HTML for the toy script section
  */
 function generateToyScriptSection(post) {
-  if (!hasToy(post)) {
+  if (false) {
     return '';
   }
killedBy: Blog Generator should generate complete HTML page with multiple posts
statusReason: TypeError: Cannot read properties of undefined (reading 'modulePath')

[Killed] StringLiteral
src/generator/generator.js:826:12
  */
 function generateToyScriptSection(post) {
   if (!hasToy(post)) {
-    return '';
+    return "Stryker was here!";
   }
   
killedBy: Blog Generator should generate complete HTML page with multiple posts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

[Killed] BlockStatement
src/generator/generator.js:837:35
  * @param {Object} post - The blog post.
  * @returns {string[]} - An array of HTML sections.
  */
-function getArticleSections(post) {
-  const headerSection = generateHeaderSection(post);
-  const mediaSection = generateMediaSections(post);
-  const contentSection = generateContentSections(post);
-  const toyUISection = generateToyUISection(post);
-  const relatedLinksSection = generateRelatedLinksSection(post);
-  const toyScriptSection = generateToyScriptSection(post);
- 
-  return [
-    headerSection,
-    mediaSection,
-    contentSection,
-    toyUISection,
-    relatedLinksSection,
-    toyScriptSection
-  ];
-}
+function getArticleSections(post) {}
 
 /**
killedBy: Blog Generator should generate complete HTML page with multiple posts
statusReason: TypeError: getArticleSections(...) is not iterable (cannot read property undefined)

[Killed] BlockStatement
src/generator/generator.js:858:39
 /**
  * Generate the content of a blog post article
  */
-function generateArticleContent(post) {
-  return combineHTMLSections(...getArticleSections(post));
-}
+function generateArticleContent(post) {}
 
 /**
killedBy: Blog Generator should generate complete HTML page with multiple posts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

[Killed] BlockStatement
src/generator/generator.js:865:59
 /**
  * Create blog HTML content array
  */
-function createBlogContentArray(header, articles, footer) {
-  // Remove the newline character between elements
-  return [header, articles, footer];
-}
+function createBlogContentArray(header, articles, footer) {}
 
 /**
killedBy: Blog Generator should generate complete HTML page with multiple posts
statusReason: TypeError: Cannot read properties of undefined (reading 'join')

[Killed] BlockStatement
src/generator/generator.js:877:55
  * @param {string} footer - The footer HTML.
  * @returns {string} - Combined HTML content.
  */
-function getBlogHtmlContent(header, articles, footer) {
-  const contentArray = createBlogContentArray(header, articles, footer);
-  return contentArray.join('');
-}
+function getBlogHtmlContent(header, articles, footer) {}
 
 /**
killedBy: Blog Generator should generate complete HTML page with multiple posts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Received: "<html></html>"

[Killed] BlockStatement
src/generator/generator.js:887:28
  * @param {Object} blog - The blog object.
  * @returns {string} - Combined HTML for all articles.
  */
-function getArticles(blog) {
-  return generateArticles(blog.posts);
-}
+function getArticles(blog) {}
 
 /**
killedBy: Blog Generator should generate complete HTML page with multiple posts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Received: "<html><body></body></html>"

[Killed] BlockStatement
src/generator/generator.js:898:49
  * @param {string} footer - The footer HTML.
  * @returns {string} - The combined HTML content.
  */
-function assembleBlogHTML(header, blog, footer) {
-  const articles = getArticles(blog);
-  return getBlogHtmlContent(header, articles, footer);
-}
+function assembleBlogHTML(header, blog, footer) {}
 
 export function generateBlog(blog, header, footer, wrapHtml) {
killedBy: Blog Generator should generate complete HTML page with multiple posts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Received: "<html></html>"

[Killed] BlockStatement
src/generator/generator.js:903:62
   return getBlogHtmlContent(header, articles, footer);
 }
 
-export function generateBlog(blog, header, footer, wrapHtml) {
-  const htmlContents = assembleBlogHTML(header, blog, footer);
-  return wrapHtml(htmlContents);
-}
+export function generateBlog(blog, header, footer, wrapHtml) {}
 
 const createBlogComponents = () => ({
killedBy: Blog Generator should generate complete HTML page with multiple posts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Received: undefined

[Survived] ArrowFunction
src/generator/generator.js:908:30
   return wrapHtml(htmlContents);
 }
 
-const createBlogComponents = () => ({
-  header: createPageHeader(),
-  footer: createPageFooter(),
-  wrapFunc: wrapHtml,
-});
+const createBlogComponents = () => undefined;
 
 /**

[NoCoverage] BlockStatement
src/generator/generator.js:918:34
  * Extracts the blog generation arguments from the blog components.
  * @returns {Object} - An object containing header, footer, and wrapFunc.
  */
-function getBlogGenerationArgs() {
-  const components = createBlogComponents();
-  const { header, footer, wrapFunc } = components;
-  return { header, footer, wrapFunc };
-}
+function getBlogGenerationArgs() {}
 
 export const generateBlogOuter = (blog) => {

[NoCoverage] ObjectLiteral
src/generator/generator.js:921:10
 function getBlogGenerationArgs() {
   const components = createBlogComponents();
   const { header, footer, wrapFunc } = components;
-  return { header, footer, wrapFunc };
+  return {};
 }
 

[NoCoverage] BlockStatement
src/generator/generator.js:924:44
   return { header, footer, wrapFunc };
 }
 
-export const generateBlogOuter = (blog) => {
-  const { header, footer, wrapFunc } = getBlogGenerationArgs();
-  return generateBlog(blog, header, footer, wrapFunc);
-};
+export const generateBlogOuter = (blog) => {};
 
