[NoCoverage] BlockStatement
src/generator/interactive.js:8:82
  * @param {string} functionName - Name of the function to import from the module
  * @returns {string} - HTML script tag that registers the component
  */
-export function generateInteractiveComponentScript(id, modulePath, functionName) {
-  return `<script type="module">window.addComponent('${id}', '${modulePath}', '${functionName}');</script>`;
-}
+export function generateInteractiveComponentScript(id, modulePath, functionName) {}
 
 /**

[NoCoverage] StringLiteral
src/generator/interactive.js:9:10
  * @returns {string} - HTML script tag that registers the component
  */
 export function generateInteractiveComponentScript(id, modulePath, functionName) {
-  return `<script type="module">window.addComponent('${id}', '${modulePath}', '${functionName}');</script>`;
+  return ``;
 }
 

[NoCoverage] BlockStatement
src/generator/interactive.js:30:91
  * @param {string} functionName - Name of the function to import from the module
  * @returns {string} - Complete HTML for the interactive article
  */
-export function generateCompleteInteractiveComponent(id, title, modulePath, functionName) {
-  const structure = generateInteractiveComponentHTML(id, title);
-  const script = generateInteractiveComponentScript(id, modulePath, functionName);
-  
-  return structure + script;
-}
+export function generateCompleteInteractiveComponent(id, title, modulePath, functionName) {}
 

[NoCoverage] ArithmeticOperator
src/generator/interactive.js:34:10
   const structure = generateInteractiveComponentHTML(id, title);
   const script = generateInteractiveComponentScript(id, modulePath, functionName);
   
-  return structure + script;
+  return structure - script;
 }
 
