[NoCoverage] ConditionalExpression
src/generator/main.js:8:9
   audioElements.forEach(function(audio, index) {
     audio.removeAttribute("controls");
     
-    if (!audio.id) {
+    if (false) {
       audio.id = "audio-" + index;
     }

[NoCoverage] BlockStatement
src/generator/main.js:8:20
   audioElements.forEach(function(audio, index) {
     audio.removeAttribute("controls");
     
-    if (!audio.id) {
-      audio.id = "audio-" + index;
-    }
+    if (!audio.id) {}
     
     const controlsContainer = document.createElement("div");

[NoCoverage] StringLiteral
src/generator/main.js:12:54
       audio.id = "audio-" + index;
     }
     
-    const controlsContainer = document.createElement("div");
+    const controlsContainer = document.createElement("");
     controlsContainer.className = "audio-controls";
     controlsContainer.id = "controls-" + audio.id;

[NoCoverage] StringLiteral
src/generator/main.js:20:47
     timeDisplay.className = "audio-time";
     timeDisplay.textContent = "0:00";
     
-    const playButton = document.createElement("a");
+    const playButton = document.createElement("");
     playButton.href = "#";
     playButton.textContent = "PLAY";

[NoCoverage] BlockStatement
src/generator/main.js:23:54
     const playButton = document.createElement("a");
     playButton.href = "#";
     playButton.textContent = "PLAY";
-    playButton.addEventListener("click", function(e) {
-      e.preventDefault();
-      audio.play();
-    });
+    playButton.addEventListener("click", function(e) {});
     
     const pauseButton = document.createElement("a");

[NoCoverage] StringLiteral
src/generator/main.js:23:33
     const playButton = document.createElement("a");
     playButton.href = "#";
     playButton.textContent = "PLAY";
-    playButton.addEventListener("click", function(e) {
+    playButton.addEventListener("", function(e) {
       e.preventDefault();
       audio.play();

[NoCoverage] StringLiteral
src/generator/main.js:30:31
     
     const pauseButton = document.createElement("a");
     pauseButton.href = "#";
-    pauseButton.textContent = "PAUSE";
+    pauseButton.textContent = "";
     pauseButton.addEventListener("click", function(e) {
       e.preventDefault();

[NoCoverage] BlockStatement
src/generator/main.js:31:55
     const pauseButton = document.createElement("a");
     pauseButton.href = "#";
     pauseButton.textContent = "PAUSE";
-    pauseButton.addEventListener("click", function(e) {
-      e.preventDefault();
-      audio.pause();
-    });
+    pauseButton.addEventListener("click", function(e) {});
     
     const stopButton = document.createElement("a");

[NoCoverage] StringLiteral
src/generator/main.js:31:34
     const pauseButton = document.createElement("a");
     pauseButton.href = "#";
     pauseButton.textContent = "PAUSE";
-    pauseButton.addEventListener("click", function(e) {
+    pauseButton.addEventListener("", function(e) {
       e.preventDefault();
       audio.pause();

[NoCoverage] StringLiteral
src/generator/main.js:38:30
     
     const stopButton = document.createElement("a");
     stopButton.href = "#";
-    stopButton.textContent = "STOP";
+    stopButton.textContent = "";
     stopButton.addEventListener("click", function(e) {
       e.preventDefault();

[NoCoverage] BlockStatement
src/generator/main.js:39:54
     const stopButton = document.createElement("a");
     stopButton.href = "#";
     stopButton.textContent = "STOP";
-    stopButton.addEventListener("click", function(e) {
-      e.preventDefault();
-      audio.pause();
-      audio.currentTime = 0;
-    });
+    stopButton.addEventListener("click", function(e) {});
     
     audio.addEventListener("timeupdate", function() {

[NoCoverage] BlockStatement
src/generator/main.js:45:53
       audio.currentTime = 0;
     });
     
-    audio.addEventListener("timeupdate", function() {
-      const minutes = Math.floor(audio.currentTime / 60);
-      const seconds = Math.floor(audio.currentTime % 60).toString().padStart(2, "0");
-      timeDisplay.textContent = minutes + ":" + seconds;
-    });
+    audio.addEventListener("timeupdate", function() {});
     
     controlsContainer.appendChild(playButton);

[NoCoverage] StringLiteral
src/generator/main.js:45:28
       audio.currentTime = 0;
     });
     
-    audio.addEventListener("timeupdate", function() {
+    audio.addEventListener("", function() {
       const minutes = Math.floor(audio.currentTime / 60);
       const seconds = Math.floor(audio.currentTime % 60).toString().padStart(2, "0");

[NoCoverage] ArithmeticOperator
src/generator/main.js:46:34
     });
     
     audio.addEventListener("timeupdate", function() {
-      const minutes = Math.floor(audio.currentTime / 60);
+      const minutes = Math.floor(audio.currentTime * 60);
       const seconds = Math.floor(audio.currentTime % 60).toString().padStart(2, "0");
       timeDisplay.textContent = minutes + ":" + seconds;

[NoCoverage] ArithmeticOperator
src/generator/main.js:47:34
     
     audio.addEventListener("timeupdate", function() {
       const minutes = Math.floor(audio.currentTime / 60);
-      const seconds = Math.floor(audio.currentTime % 60).toString().padStart(2, "0");
+      const seconds = Math.floor(audio.currentTime * 60).toString().padStart(2, "0");
       timeDisplay.textContent = minutes + ":" + seconds;
     });

[NoCoverage] StringLiteral
src/generator/main.js:48:43
     audio.addEventListener("timeupdate", function() {
       const minutes = Math.floor(audio.currentTime / 60);
       const seconds = Math.floor(audio.currentTime % 60).toString().padStart(2, "0");
-      timeDisplay.textContent = minutes + ":" + seconds;
+      timeDisplay.textContent = minutes + "" + seconds;
     });
     

[NoCoverage] StringLiteral
src/generator/main.js:56:59
     controlsContainer.appendChild(pauseButton);
     controlsContainer.appendChild(document.createTextNode(" "));
     controlsContainer.appendChild(stopButton);
-    controlsContainer.appendChild(document.createTextNode(" "));
+    controlsContainer.appendChild(document.createTextNode(""));
     controlsContainer.appendChild(timeDisplay);
     

[NoCoverage] StringLiteral
src/generator/main.js:75:46
   
   // Get the elements within the article
   const inputElement = article.querySelector('input');
-  const submitButton = article.querySelector('button');
+  const submitButton = article.querySelector("");
   const outputElement = article.querySelector('p.output');
   

[NoCoverage] StringLiteral
src/generator/main.js:76:47
   // Get the elements within the article
   const inputElement = article.querySelector('input');
   const submitButton = article.querySelector('button');
-  const outputElement = article.querySelector('p.output');
+  const outputElement = article.querySelector("");
   
   // Disable controls during initialization

[NoCoverage] BooleanLiteral
src/generator/main.js:79:27
   const outputElement = article.querySelector('p.output');
   
   // Disable controls during initialization
-  inputElement.disabled = true;
+  inputElement.disabled = false;
   submitButton.disabled = true;
   

[NoCoverage] BooleanLiteral
src/generator/main.js:80:27
   
   // Disable controls during initialization
   inputElement.disabled = true;
-  submitButton.disabled = true;
+  submitButton.disabled = false;
   
   // Update message to show JS is running

[NoCoverage] BlockStatement
src/generator/main.js:88:29
   /**
    * Enable controls and update status message
    */
-  function enableControls() {
-    inputElement.disabled = false;
-    submitButton.disabled = false;
-    outputElement.textContent = 'Ready for input';
-    outputElement.parentElement.classList.remove('warning');
-  }
+  function enableControls() {}
   
   /**

[NoCoverage] BooleanLiteral
src/generator/main.js:89:29
    * Enable controls and update status message
    */
   function enableControls() {
-    inputElement.disabled = false;
+    inputElement.disabled = true;
     submitButton.disabled = false;
     outputElement.textContent = 'Ready for input';

[NoCoverage] BooleanLiteral
src/generator/main.js:90:29
    */
   function enableControls() {
     inputElement.disabled = false;
-    submitButton.disabled = false;
+    submitButton.disabled = true;
     outputElement.textContent = 'Ready for input';
     outputElement.parentElement.classList.remove('warning');

[NoCoverage] BlockStatement
src/generator/main.js:99:32
    * Handle form submission events
    * @param {Event} event - The submission event
    */
-  function handleSubmit(event) {
-    if (event) {
-      event.preventDefault();
-    }
-    const inputValue = inputElement.value;
-    
-    // Use the provided processing function
-    const result = processingFunction(inputValue);
-    
-    // Update the output
-    outputElement.textContent = result;
-  }
+  function handleSubmit(event) {}
   
   // Add event listener to the submit button

[NoCoverage] ConditionalExpression
src/generator/main.js:100:9
    * @param {Event} event - The submission event
    */
   function handleSubmit(event) {
-    if (event) {
+    if (false) {
       event.preventDefault();
     }

[NoCoverage] ConditionalExpression
src/generator/main.js:100:9
    * @param {Event} event - The submission event
    */
   function handleSubmit(event) {
-    if (event) {
+    if (true) {
       event.preventDefault();
     }

[NoCoverage] StringLiteral
src/generator/main.js:113:33
   }
   
   // Add event listener to the submit button
-  submitButton.addEventListener('click', handleSubmit);
+  submitButton.addEventListener("", handleSubmit);
   
   // Add event listener for Enter key in the input field

[NoCoverage] BlockStatement
src/generator/main.js:116:56
   submitButton.addEventListener('click', handleSubmit);
   
   // Add event listener for Enter key in the input field
-  inputElement.addEventListener('keypress', (event) => {
-    if (event.key === 'Enter') {
-      handleSubmit(event);
-    }
-  });
+  inputElement.addEventListener('keypress', (event) => {});
   
   // Enable controls when initialization is complete

[NoCoverage] StringLiteral
src/generator/main.js:116:33
   submitButton.addEventListener('click', handleSubmit);
   
   // Add event listener for Enter key in the input field
-  inputElement.addEventListener('keypress', (event) => {
+  inputElement.addEventListener("", (event) => {
     if (event.key === 'Enter') {
       handleSubmit(event);

[NoCoverage] EqualityOperator
src/generator/main.js:117:9
   
   // Add event listener for Enter key in the input field
   inputElement.addEventListener('keypress', (event) => {
-    if (event.key === 'Enter') {
+    if (event.key !== 'Enter') {
       handleSubmit(event);
     }

[NoCoverage] ConditionalExpression
src/generator/main.js:117:9
   
   // Add event listener for Enter key in the input field
   inputElement.addEventListener('keypress', (event) => {
-    if (event.key === 'Enter') {
+    if (false) {
       handleSubmit(event);
     }

[NoCoverage] BlockStatement
src/generator/main.js:136:68
   const article = document.getElementById(id);
   
   // Create an observer instance
-  const observer = new IntersectionObserver((entries, observer) => {
-    entries.forEach(entry => {
-      // If the article is visible
-      if (entry.isIntersecting) {
-        // Dynamically import the module only when the article is visible
-        import(modulePath).then((module) => {
-          const processingFunction = module[functionName];
-          
-          // Initialize the component with the imported function
-          initializeInteractiveComponent(id, processingFunction);
-        }).catch(error => {
-          console.error('Error loading module ' + modulePath + ':', error);
-        });
-        
-        // Stop observing once initialized
-        observer.disconnect();
-      }
-    });
-  }, {
+  const observer = new IntersectionObserver((entries, observer) => {}, {
     // Options for the observer
     root: null, // viewport

[NoCoverage] BlockStatement
src/generator/main.js:137:30
   
   // Create an observer instance
   const observer = new IntersectionObserver((entries, observer) => {
-    entries.forEach(entry => {
-      // If the article is visible
-      if (entry.isIntersecting) {
-        // Dynamically import the module only when the article is visible
-        import(modulePath).then((module) => {
-          const processingFunction = module[functionName];
-          
-          // Initialize the component with the imported function
-          initializeInteractiveComponent(id, processingFunction);
-        }).catch(error => {
-          console.error('Error loading module ' + modulePath + ':', error);
-        });
-        
-        // Stop observing once initialized
-        observer.disconnect();
-      }
-    });
+    entries.forEach(entry => {});
   }, {
     // Options for the observer

[NoCoverage] ConditionalExpression
src/generator/main.js:139:11
   const observer = new IntersectionObserver((entries, observer) => {
     entries.forEach(entry => {
       // If the article is visible
-      if (entry.isIntersecting) {
+      if (false) {
         // Dynamically import the module only when the article is visible
         import(modulePath).then((module) => {

[NoCoverage] ConditionalExpression
src/generator/main.js:139:11
   const observer = new IntersectionObserver((entries, observer) => {
     entries.forEach(entry => {
       // If the article is visible
-      if (entry.isIntersecting) {
+      if (true) {
         // Dynamically import the module only when the article is visible
         import(modulePath).then((module) => {

[NoCoverage] BlockStatement
src/generator/main.js:141:45
       // If the article is visible
       if (entry.isIntersecting) {
         // Dynamically import the module only when the article is visible
-        import(modulePath).then((module) => {
-          const processingFunction = module[functionName];
-          
-          // Initialize the component with the imported function
-          initializeInteractiveComponent(id, processingFunction);
-        }).catch(error => {
+        import(modulePath).then((module) => {}).catch(error => {
           console.error('Error loading module ' + modulePath + ':', error);
         });

[NoCoverage] BlockStatement
src/generator/main.js:146:27
           
           // Initialize the component with the imported function
           initializeInteractiveComponent(id, processingFunction);
-        }).catch(error => {
-          console.error('Error loading module ' + modulePath + ':', error);
-        });
+        }).catch(error => {});
         
         // Stop observing once initialized

[NoCoverage] StringLiteral
src/generator/main.js:147:64
           // Initialize the component with the imported function
           initializeInteractiveComponent(id, processingFunction);
         }).catch(error => {
-          console.error('Error loading module ' + modulePath + ':', error);
+          console.error('Error loading module ' + modulePath + "", error);
         });
         

[NoCoverage] LogicalOperator
src/generator/main.js:165:5
 }
 
 // Initialize all registered components when they become visible
-if (window.interactiveComponents && window.interactiveComponents.length > 0) {
+if (window.interactiveComponents || window.interactiveComponents.length > 0) {
   console.log('Initializing', window.interactiveComponents.length, 'interactive components');
   window.interactiveComponents.forEach(component => {

[NoCoverage] ConditionalExpression
src/generator/main.js:165:37
 }
 
 // Initialize all registered components when they become visible
-if (window.interactiveComponents && window.interactiveComponents.length > 0) {
+if (window.interactiveComponents && true) {
   console.log('Initializing', window.interactiveComponents.length, 'interactive components');
   window.interactiveComponents.forEach(component => {

[NoCoverage] BlockStatement
src/generator/main.js:167:53
 // Initialize all registered components when they become visible
 if (window.interactiveComponents && window.interactiveComponents.length > 0) {
   console.log('Initializing', window.interactiveComponents.length, 'interactive components');
-  window.interactiveComponents.forEach(component => {
-    initializeWhenVisible(component.id, component.modulePath, component.functionName);
-  });
+  window.interactiveComponents.forEach(component => {});
 } else {
   console.warn('No interactive components found to initialize');

[NoCoverage] BlockStatement
src/generator/main.js:170:8
   window.interactiveComponents.forEach(component => {
     initializeWhenVisible(component.id, component.modulePath, component.functionName);
   });
-} else {
-  console.warn('No interactive components found to initialize');
-}
+} else {}
 
 // Tag filtering functionality

[NoCoverage] StringLiteral
src/generator/main.js:171:16
     initializeWhenVisible(component.id, component.modulePath, component.functionName);
   });
 } else {
-  console.warn('No interactive components found to initialize');
+  console.warn("");
 }
 

[NoCoverage] BlockStatement
src/generator/main.js:175:41
 }
 
 // Tag filtering functionality
-function hideArticlesByClass(className) {
-  var articles = document.getElementsByTagName('article');
-  for (var i = 0; i < articles.length; i++) {
-    if (articles[i].classList.contains(className)) {
-      articles[i].style.display = 'none';
-    }
-  }
-}
+function hideArticlesByClass(className) {}
 
 function toggleHideLink(link, className) {

[NoCoverage] EqualityOperator
src/generator/main.js:177:19
 // Tag filtering functionality
 function hideArticlesByClass(className) {
   var articles = document.getElementsByTagName('article');
-  for (var i = 0; i < articles.length; i++) {
+  for (var i = 0; i >= articles.length; i++) {
     if (articles[i].classList.contains(className)) {
       articles[i].style.display = 'none';

[NoCoverage] EqualityOperator
src/generator/main.js:177:19
 // Tag filtering functionality
 function hideArticlesByClass(className) {
   var articles = document.getElementsByTagName('article');
-  for (var i = 0; i < articles.length; i++) {
+  for (var i = 0; i <= articles.length; i++) {
     if (articles[i].classList.contains(className)) {
       articles[i].style.display = 'none';

[NoCoverage] ConditionalExpression
src/generator/main.js:178:9
 function hideArticlesByClass(className) {
   var articles = document.getElementsByTagName('article');
   for (var i = 0; i < articles.length; i++) {
-    if (articles[i].classList.contains(className)) {
+    if (true) {
       articles[i].style.display = 'none';
     }

[NoCoverage] ConditionalExpression
src/generator/main.js:178:9
 function hideArticlesByClass(className) {
   var articles = document.getElementsByTagName('article');
   for (var i = 0; i < articles.length; i++) {
-    if (articles[i].classList.contains(className)) {
+    if (false) {
       articles[i].style.display = 'none';
     }

[NoCoverage] StringLiteral
src/generator/main.js:179:35
   var articles = document.getElementsByTagName('article');
   for (var i = 0; i < articles.length; i++) {
     if (articles[i].classList.contains(className)) {
-      articles[i].style.display = 'none';
+      articles[i].style.display = "";
     }
   }

[NoCoverage] ConditionalExpression
src/generator/main.js:186:7
 
 function toggleHideLink(link, className) {
   // Check if a span with the hide link already exists immediately after the link.
-  if (link.nextElementSibling && link.nextElementSibling.classList.contains('hide-span')) {
+  if (true) {
     // Remove the span if it exists.
     link.nextElementSibling.remove();

[NoCoverage] ConditionalExpression
src/generator/main.js:186:7
 
 function toggleHideLink(link, className) {
   // Check if a span with the hide link already exists immediately after the link.
-  if (link.nextElementSibling && link.nextElementSibling.classList.contains('hide-span')) {
+  if (false) {
     // Remove the span if it exists.
     link.nextElementSibling.remove();

[NoCoverage] BlockStatement
src/generator/main.js:189:10
   if (link.nextElementSibling && link.nextElementSibling.classList.contains('hide-span')) {
     // Remove the span if it exists.
     link.nextElementSibling.remove();
-  } else {
-    // Create a new span element.
-    var span = document.createElement('span');
-    span.classList.add('hide-span');
-    // Append the opening text node.
-    span.appendChild(document.createTextNode(" ("));
-
-    // Create the hide anchor element.
-    var hideLink = document.createElement('a');
-    hideLink.textContent = "hide";
-    // Add click listener to trigger hideArticlesByClass.
-    hideLink.addEventListener('click', function(event) {
-      event.preventDefault();
-      hideArticlesByClass(className);
-    });
-    span.appendChild(hideLink);
-    // Append the closing text node.
-    span.appendChild(document.createTextNode(")"));
-
-    // Insert the span immediately after the link.
-    link.parentNode.insertBefore(span, link.nextSibling);
-  }
+  } else {}
 }
 

[NoCoverage] StringLiteral
src/generator/main.js:198:28
 
     // Create the hide anchor element.
     var hideLink = document.createElement('a');
-    hideLink.textContent = "hide";
+    hideLink.textContent = "";
     // Add click listener to trigger hideArticlesByClass.
     hideLink.addEventListener('click', function(event) {

[NoCoverage] BlockStatement
src/generator/main.js:200:56
     var hideLink = document.createElement('a');
     hideLink.textContent = "hide";
     // Add click listener to trigger hideArticlesByClass.
-    hideLink.addEventListener('click', function(event) {
-      event.preventDefault();
-      hideArticlesByClass(className);
-    });
+    hideLink.addEventListener('click', function(event) {});
     span.appendChild(hideLink);
     // Append the closing text node.

[NoCoverage] StringLiteral
src/generator/main.js:200:31
     var hideLink = document.createElement('a');
     hideLink.textContent = "hide";
     // Add click listener to trigger hideArticlesByClass.
-    hideLink.addEventListener('click', function(event) {
+    hideLink.addEventListener("", function(event) {
       event.preventDefault();
       hideArticlesByClass(className);

[NoCoverage] BlockStatement
src/generator/main.js:213:13
   }
 }
 
-(function() {
-  Array.from(document.getElementsByTagName('a')).forEach(function(link) {
-    Array.from(link.classList).forEach(function(className) {
-      if (className.indexOf('tag-') === 0) {
-        link.addEventListener('click', function(event) {
-          event.preventDefault();
-          toggleHideLink(link, className);
-        });
-        return; // exit after first tag- match
-      }
-    });
-  });
-})();
+(function() {})();

[NoCoverage] BlockStatement
src/generator/main.js:214:73
 }
 
 (function() {
-  Array.from(document.getElementsByTagName('a')).forEach(function(link) {
-    Array.from(link.classList).forEach(function(className) {
-      if (className.indexOf('tag-') === 0) {
-        link.addEventListener('click', function(event) {
-          event.preventDefault();
-          toggleHideLink(link, className);
-        });
-        return; // exit after first tag- match
-      }
-    });
-  });
+  Array.from(document.getElementsByTagName('a')).forEach(function(link) {});
 })();

[NoCoverage] BlockStatement
src/generator/main.js:215:60
 
 (function() {
   Array.from(document.getElementsByTagName('a')).forEach(function(link) {
-    Array.from(link.classList).forEach(function(className) {
-      if (className.indexOf('tag-') === 0) {
-        link.addEventListener('click', function(event) {
-          event.preventDefault();
-          toggleHideLink(link, className);
-        });
-        return; // exit after first tag- match
-      }
-    });
+    Array.from(link.classList).forEach(function(className) {});
   });
 })();

[NoCoverage] ConditionalExpression
src/generator/main.js:216:11
 (function() {
   Array.from(document.getElementsByTagName('a')).forEach(function(link) {
     Array.from(link.classList).forEach(function(className) {
-      if (className.indexOf('tag-') === 0) {
+      if (false) {
         link.addEventListener('click', function(event) {
           event.preventDefault();

[NoCoverage] EqualityOperator
src/generator/main.js:216:11
 (function() {
   Array.from(document.getElementsByTagName('a')).forEach(function(link) {
     Array.from(link.classList).forEach(function(className) {
-      if (className.indexOf('tag-') === 0) {
+      if (className.indexOf('tag-') !== 0) {
         link.addEventListener('click', function(event) {
           event.preventDefault();

[NoCoverage] BlockStatement
src/generator/main.js:217:56
   Array.from(document.getElementsByTagName('a')).forEach(function(link) {
     Array.from(link.classList).forEach(function(className) {
       if (className.indexOf('tag-') === 0) {
-        link.addEventListener('click', function(event) {
-          event.preventDefault();
-          toggleHideLink(link, className);
-        });
+        link.addEventListener('click', function(event) {});
         return; // exit after first tag- match
       }
