[Killed] BlockStatement
src/toys/2024-10-02/hello.js:5:25
  * A simple hello world function
  * @returns {string} A greeting message
  */
-export function hello() {
-  return "Hello world";
-}
+export function hello() {}
 
killedBy: hello should return "Hello world"
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Hello world"
Received: undefined
