[Killed] BlockStatement
src/toys/2025-03-19/identity.js:7:33
  * @param {*} value - Any value to be returned
  * @returns {*} The same value that was passed in
  */
-export function identity(value) {
-  return value;
-}
+export function identity(value) {}
 
killedBy: identity function returns primitive values unchanged
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 42
Received: undefined
