[Killed] BlockStatement
src/toys/2025-03-21/booleanCoercer.js:9:40
  * @param {any} input - The value to coerce to boolean
  * @returns {string} - String representation of object with 'value' property if coercion successful, '{}' if not
  */
-export function coerceToBoolean(input) {
-  const booleanMap = {
-    true: true,
-    false: false
-  };
-
-  if (typeof input === 'boolean') {
-    return `{ value: ${input} }`;
-  }
-
-  const normalized = (typeof input === 'string') ? booleanMap[input.toLowerCase()] : undefined;
-
-  return typeof normalized === 'boolean' ? `{ value: ${normalized} }` : '{}';
-}
+export function coerceToBoolean(input) {}
killedBy: coerceToBoolean returns { value: true } for input boolean true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "{ value: true }"
Received: undefined

[Killed] BooleanLiteral
src/toys/2025-03-21/booleanCoercer.js:11:11
  */
 export function coerceToBoolean(input) {
   const booleanMap = {
-    true: true,
+    true: false,
     false: false
   };
killedBy: coerceToBoolean returns { value: true } for input string "true"
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "{ value: true }"
Received: "{ value: false }"

[Killed] BooleanLiteral
src/toys/2025-03-21/booleanCoercer.js:12:12
 export function coerceToBoolean(input) {
   const booleanMap = {
     true: true,
-    false: false
+    false: true
   };
 
killedBy: coerceToBoolean returns { value: false } for input string "false"
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "{ value: false }"
Received: "{ value: true }"

[Killed] EqualityOperator
src/toys/2025-03-21/booleanCoercer.js:15:7
     false: false
   };
 
-  if (typeof input === 'boolean') {
+  if (typeof input !== 'boolean') {
     return `{ value: ${input} }`;
   }
killedBy: coerceToBoolean returns { value: true } for input boolean true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "{ value: true }"
Received: "{}"

[Killed] ConditionalExpression
src/toys/2025-03-21/booleanCoercer.js:15:7
     false: false
   };
 
-  if (typeof input === 'boolean') {
+  if (false) {
     return `{ value: ${input} }`;
   }
killedBy: coerceToBoolean returns { value: true } for input boolean true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "{ value: true }"
Received: "{}"

[Killed] StringLiteral
src/toys/2025-03-21/booleanCoercer.js:16:12
   };
 
   if (typeof input === 'boolean') {
-    return `{ value: ${input} }`;
+    return ``;
   }
 
killedBy: coerceToBoolean returns { value: true } for input boolean true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "{ value: true }"
Received: ""

[Killed] ConditionalExpression
src/toys/2025-03-21/booleanCoercer.js:19:23
     return `{ value: ${input} }`;
   }
 
-  const normalized = (typeof input === 'string') ? booleanMap[input.toLowerCase()] : undefined;
+  const normalized = (true) ? booleanMap[input.toLowerCase()] : undefined;
 
   return typeof normalized === 'boolean' ? `{ value: ${normalized} }` : '{}';
killedBy: coerceToBoolean returns {} for non-boolean and non-valid string input (number)
statusReason: TypeError: input.toLowerCase is not a function

[Killed] EqualityOperator
src/toys/2025-03-21/booleanCoercer.js:19:23
     return `{ value: ${input} }`;
   }
 
-  const normalized = (typeof input === 'string') ? booleanMap[input.toLowerCase()] : undefined;
+  const normalized = (typeof input !== 'string') ? booleanMap[input.toLowerCase()] : undefined;
 
   return typeof normalized === 'boolean' ? `{ value: ${normalized} }` : '{}';
killedBy: coerceToBoolean returns { value: true } for input string "true"
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "{ value: true }"
Received: "{}"

[Killed] EqualityOperator
src/toys/2025-03-21/booleanCoercer.js:21:10
 
   const normalized = (typeof input === 'string') ? booleanMap[input.toLowerCase()] : undefined;
 
-  return typeof normalized === 'boolean' ? `{ value: ${normalized} }` : '{}';
+  return typeof normalized !== 'boolean' ? `{ value: ${normalized} }` : '{}';
 }
killedBy: coerceToBoolean returns { value: true } for input string "true"
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "{ value: true }"
Received: "{}"

[Killed] ConditionalExpression
src/toys/2025-03-21/booleanCoercer.js:21:10
 
   const normalized = (typeof input === 'string') ? booleanMap[input.toLowerCase()] : undefined;
 
-  return typeof normalized === 'boolean' ? `{ value: ${normalized} }` : '{}';
+  return false ? `{ value: ${normalized} }` : '{}';
 }
killedBy: coerceToBoolean returns { value: true } for input string "true"
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "{ value: true }"
Received: "{}"
